MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1403-Q040X0064/mcu.h
/* ---------------------------------  MATH_CORDX  --------------------------------- */
#define MATH_CORDX_DATA_Pos                   (8UL)                     /*!< MATH CORDX: DATA (Bit 8)                                    */
#define MATH_CORDX_DATA_Msk                   (0xffffff00UL)            /*!< MATH CORDX: DATA (Bitfield-Mask: 0xffffff)                  */

/* ---------------------------------  MATH_CORDY  --------------------------------- */
#define MATH_CORDY_DATA_Pos                   (8UL)                     /*!< MATH CORDY: DATA (Bit 8)                                    */
#define MATH_CORDY_DATA_Msk                   (0xffffff00UL)            /*!< MATH CORDY: DATA (Bitfield-Mask: 0xffffff)                  */

/* ---------------------------------  MATH_CORDZ  --------------------------------- */
#define MATH_CORDZ_DATA_Pos                   (8UL)                     /*!< MATH CORDZ: DATA (Bit 8)                                    */
#define MATH_CORDZ_DATA_Msk                   (0xffffff00UL)            /*!< MATH CORDZ: DATA (Bitfield-Mask: 0xffffff)                  */

/* ---------------------------------  MATH_CORRX  --------------------------------- */
#define MATH_CORRX_RESULT_Pos                 (8UL)                     /*!< MATH CORRX: RESULT (Bit 8)                                  */
#define MATH_CORRX_RESULT_Msk                 (0xffffff00UL)            /*!< MATH CORRX: RESULT (Bitfield-Mask: 0xffffff)                */

/* ---------------------------------  MATH_CORRY  --------------------------------- */
#define MATH_CORRY_RESULT_Pos                 (8UL)                     /*!< MATH CORRY: RESULT (Bit 8)                                  */
#define MATH_CORRY_RESULT_Msk                 (0xffffff00UL)            /*!< MATH CORRY: RESULT (Bitfield-Mask: 0xffffff)                */

/* ---------------------------------  MATH_CORRZ  --------------------------------- */
#define MATH_CORRZ_RESULT_Pos                 (8UL)                     /*!< MATH CORRZ: RESULT (Bit 8)                                  */
#define MATH_CORRZ_RESULT_Msk                 (0xffffff00UL)            /*!< MATH CORRZ: RESULT (Bitfield-Mask: 0xffffff)                */


/* ================================================================================ */
/* ================          struct 'PAU' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  PAU_AVAIL0  --------------------------------- */
#define PAU_AVAIL0_AVAIL5_Pos                 (5UL)                     /*!< PAU AVAIL0: AVAIL5 (Bit 5)                                  */
#define PAU_AVAIL0_AVAIL5_Msk                 (0x20UL)                  /*!< PAU AVAIL0: AVAIL5 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL0_AVAIL6_Pos                 (6UL)                     /*!< PAU AVAIL0: AVAIL6 (Bit 6)                                  */
#define PAU_AVAIL0_AVAIL6_Msk                 (0x40UL)                  /*!< PAU AVAIL0: AVAIL6 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL0_AVAIL7_Pos                 (7UL)                     /*!< PAU AVAIL0: AVAIL7 (Bit 7)                                  */
#define PAU_AVAIL0_AVAIL7_Msk                 (0x80UL)                  /*!< PAU AVAIL0: AVAIL7 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL0_AVAIL20_Pos                (20UL)                    /*!< PAU AVAIL0: AVAIL20 (Bit 20)                                */
#define PAU_AVAIL0_AVAIL20_Msk                (0x100000UL)              /*!< PAU AVAIL0: AVAIL20 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL0_AVAIL21_Pos                (21UL)                    /*!< PAU AVAIL0: AVAIL21 (Bit 21)                                */
#define PAU_AVAIL0_AVAIL21_Msk                (0x200000UL)              /*!< PAU AVAIL0: AVAIL21 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL0_AVAIL22_Pos                (22UL)                    /*!< PAU AVAIL0: AVAIL22 (Bit 22)                                */
#define PAU_AVAIL0_AVAIL22_Msk                (0x400000UL)              /*!< PAU AVAIL0: AVAIL22 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL0_AVAIL23_Pos                (23UL)                    /*!< PAU AVAIL0: AVAIL23 (Bit 23)                                */
#define PAU_AVAIL0_AVAIL23_Msk                (0x800000UL)              /*!< PAU AVAIL0: AVAIL23 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL0_AVAIL24_Pos                (24UL)                    /*!< PAU AVAIL0: AVAIL24 (Bit 24)                                */
#define PAU_AVAIL0_AVAIL24_Msk                (0x1000000UL)             /*!< PAU AVAIL0: AVAIL24 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL0_AVAIL25_Pos                (25UL)                    /*!< PAU AVAIL0: AVAIL25 (Bit 25)                                */
#define PAU_AVAIL0_AVAIL25_Msk                (0x2000000UL)             /*!< PAU AVAIL0: AVAIL25 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL0_AVAIL26_Pos                (26UL)                    /*!< PAU AVAIL0: AVAIL26 (Bit 26)                                */
#define PAU_AVAIL0_AVAIL26_Msk                (0x4000000UL)             /*!< PAU AVAIL0: AVAIL26 (Bitfield-Mask: 0x01)                   */

/* ---------------------------------  PAU_AVAIL1  --------------------------------- */
#define PAU_AVAIL1_AVAIL0_Pos                 (0UL)                     /*!< PAU AVAIL1: AVAIL0 (Bit 0)                                  */
#define PAU_AVAIL1_AVAIL0_Msk                 (0x1UL)                   /*!< PAU AVAIL1: AVAIL0 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL1_Pos                 (1UL)                     /*!< PAU AVAIL1: AVAIL1 (Bit 1)                                  */
#define PAU_AVAIL1_AVAIL1_Msk                 (0x2UL)                   /*!< PAU AVAIL1: AVAIL1 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL4_Pos                 (4UL)                     /*!< PAU AVAIL1: AVAIL4 (Bit 4)                                  */
#define PAU_AVAIL1_AVAIL4_Msk                 (0x10UL)                  /*!< PAU AVAIL1: AVAIL4 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL5_Pos                 (5UL)                     /*!< PAU AVAIL1: AVAIL5 (Bit 5)                                  */
#define PAU_AVAIL1_AVAIL5_Msk                 (0x20UL)                  /*!< PAU AVAIL1: AVAIL5 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL6_Pos                 (6UL)                     /*!< PAU AVAIL1: AVAIL6 (Bit 6)                                  */
#define PAU_AVAIL1_AVAIL6_Msk                 (0x40UL)                  /*!< PAU AVAIL1: AVAIL6 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL7_Pos                 (7UL)                     /*!< PAU AVAIL1: AVAIL7 (Bit 7)                                  */
#define PAU_AVAIL1_AVAIL7_Msk                 (0x80UL)                  /*!< PAU AVAIL1: AVAIL7 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL8_Pos                 (8UL)                     /*!< PAU AVAIL1: AVAIL8 (Bit 8)                                  */
#define PAU_AVAIL1_AVAIL8_Msk                 (0x100UL)                 /*!< PAU AVAIL1: AVAIL8 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL9_Pos                 (9UL)                     /*!< PAU AVAIL1: AVAIL9 (Bit 9)                                  */
#define PAU_AVAIL1_AVAIL9_Msk                 (0x200UL)                 /*!< PAU AVAIL1: AVAIL9 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL1_AVAIL10_Pos                (10UL)                    /*!< PAU AVAIL1: AVAIL10 (Bit 10)                                */
#define PAU_AVAIL1_AVAIL10_Msk                (0x400UL)                 /*!< PAU AVAIL1: AVAIL10 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL11_Pos                (11UL)                    /*!< PAU AVAIL1: AVAIL11 (Bit 11)                                */
#define PAU_AVAIL1_AVAIL11_Msk                (0x800UL)                 /*!< PAU AVAIL1: AVAIL11 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL12_Pos                (12UL)                    /*!< PAU AVAIL1: AVAIL12 (Bit 12)                                */
#define PAU_AVAIL1_AVAIL12_Msk                (0x1000UL)                /*!< PAU AVAIL1: AVAIL12 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL16_Pos                (16UL)                    /*!< PAU AVAIL1: AVAIL16 (Bit 16)                                */
#define PAU_AVAIL1_AVAIL16_Msk                (0x10000UL)               /*!< PAU AVAIL1: AVAIL16 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL17_Pos                (17UL)                    /*!< PAU AVAIL1: AVAIL17 (Bit 17)                                */
#define PAU_AVAIL1_AVAIL17_Msk                (0x20000UL)               /*!< PAU AVAIL1: AVAIL17 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL25_Pos                (25UL)                    /*!< PAU AVAIL1: AVAIL25 (Bit 25)                                */
#define PAU_AVAIL1_AVAIL25_Msk                (0x2000000UL)             /*!< PAU AVAIL1: AVAIL25 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL26_Pos                (26UL)                    /*!< PAU AVAIL1: AVAIL26 (Bit 26)                                */
#define PAU_AVAIL1_AVAIL26_Msk                (0x4000000UL)             /*!< PAU AVAIL1: AVAIL26 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL27_Pos                (27UL)                    /*!< PAU AVAIL1: AVAIL27 (Bit 27)                                */
#define PAU_AVAIL1_AVAIL27_Msk                (0x8000000UL)             /*!< PAU AVAIL1: AVAIL27 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL1_AVAIL28_Pos                (28UL)                    /*!< PAU AVAIL1: AVAIL28 (Bit 28)                                */
#define PAU_AVAIL1_AVAIL28_Msk                (0x10000000UL)            /*!< PAU AVAIL1: AVAIL28 (Bitfield-Mask: 0x01)                   */

/* ---------------------------------  PAU_AVAIL2  --------------------------------- */
#define PAU_AVAIL2_AVAIL0_Pos                 (0UL)                     /*!< PAU AVAIL2: AVAIL0 (Bit 0)                                  */
#define PAU_AVAIL2_AVAIL0_Msk                 (0x1UL)                   /*!< PAU AVAIL2: AVAIL0 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL2_AVAIL1_Pos                 (1UL)                     /*!< PAU AVAIL2: AVAIL1 (Bit 1)                                  */
#define PAU_AVAIL2_AVAIL1_Msk                 (0x2UL)                   /*!< PAU AVAIL2: AVAIL1 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL2_AVAIL2_Pos                 (2UL)                     /*!< PAU AVAIL2: AVAIL2 (Bit 2)                                  */
#define PAU_AVAIL2_AVAIL2_Msk                 (0x4UL)                   /*!< PAU AVAIL2: AVAIL2 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL2_AVAIL3_Pos                 (3UL)                     /*!< PAU AVAIL2: AVAIL3 (Bit 3)                                  */
#define PAU_AVAIL2_AVAIL3_Msk                 (0x8UL)                   /*!< PAU AVAIL2: AVAIL3 (Bitfield-Mask: 0x01)                    */
#define PAU_AVAIL2_AVAIL12_Pos                (12UL)                    /*!< PAU AVAIL2: AVAIL12 (Bit 12)                                */
#define PAU_AVAIL2_AVAIL12_Msk                (0x1000UL)                /*!< PAU AVAIL2: AVAIL12 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL15_Pos                (15UL)                    /*!< PAU AVAIL2: AVAIL15 (Bit 15)                                */
#define PAU_AVAIL2_AVAIL15_Msk                (0x8000UL)                /*!< PAU AVAIL2: AVAIL15 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL16_Pos                (16UL)                    /*!< PAU AVAIL2: AVAIL16 (Bit 16)                                */
#define PAU_AVAIL2_AVAIL16_Msk                (0x10000UL)               /*!< PAU AVAIL2: AVAIL16 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL17_Pos                (17UL)                    /*!< PAU AVAIL2: AVAIL17 (Bit 17)                                */
#define PAU_AVAIL2_AVAIL17_Msk                (0x20000UL)               /*!< PAU AVAIL2: AVAIL17 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL18_Pos                (18UL)                    /*!< PAU AVAIL2: AVAIL18 (Bit 18)                                */
#define PAU_AVAIL2_AVAIL18_Msk                (0x40000UL)               /*!< PAU AVAIL2: AVAIL18 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL19_Pos                (19UL)                    /*!< PAU AVAIL2: AVAIL19 (Bit 19)                                */
#define PAU_AVAIL2_AVAIL19_Msk                (0x80000UL)               /*!< PAU AVAIL2: AVAIL19 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL20_Pos                (20UL)                    /*!< PAU AVAIL2: AVAIL20 (Bit 20)                                */
#define PAU_AVAIL2_AVAIL20_Msk                (0x100000UL)              /*!< PAU AVAIL2: AVAIL20 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL21_Pos                (21UL)                    /*!< PAU AVAIL2: AVAIL21 (Bit 21)                                */
#define PAU_AVAIL2_AVAIL21_Msk                (0x200000UL)              /*!< PAU AVAIL2: AVAIL21 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL23_Pos                (23UL)                    /*!< PAU AVAIL2: AVAIL23 (Bit 23)                                */
#define PAU_AVAIL2_AVAIL23_Msk                (0x800000UL)              /*!< PAU AVAIL2: AVAIL23 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL28_Pos                (28UL)                    /*!< PAU AVAIL2: AVAIL28 (Bit 28)                                */
#define PAU_AVAIL2_AVAIL28_Msk                (0x10000000UL)            /*!< PAU AVAIL2: AVAIL28 (Bitfield-Mask: 0x01)                   */
#define PAU_AVAIL2_AVAIL29_Pos                (29UL)                    /*!< PAU AVAIL2: AVAIL29 (Bit 29)                                */
#define PAU_AVAIL2_AVAIL29_Msk                (0x20000000UL)            /*!< PAU AVAIL2: AVAIL29 (Bitfield-Mask: 0x01)                   */

