MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1403-Q040X0064/mcu.h
/* --------------------------------  LEDTS1_LDCMP0  ------------------------------- */
#define LEDTS1_LDCMP0_CMP_LD0_Pos             (0UL)                     /*!< LEDTS1 LDCMP0: CMP_LD0 (Bit 0)                              */
#define LEDTS1_LDCMP0_CMP_LD0_Msk             (0xffUL)                  /*!< LEDTS1 LDCMP0: CMP_LD0 (Bitfield-Mask: 0xff)                */
#define LEDTS1_LDCMP0_CMP_LD1_Pos             (8UL)                     /*!< LEDTS1 LDCMP0: CMP_LD1 (Bit 8)                              */
#define LEDTS1_LDCMP0_CMP_LD1_Msk             (0xff00UL)                /*!< LEDTS1 LDCMP0: CMP_LD1 (Bitfield-Mask: 0xff)                */
#define LEDTS1_LDCMP0_CMP_LD2_Pos             (16UL)                    /*!< LEDTS1 LDCMP0: CMP_LD2 (Bit 16)                             */
#define LEDTS1_LDCMP0_CMP_LD2_Msk             (0xff0000UL)              /*!< LEDTS1 LDCMP0: CMP_LD2 (Bitfield-Mask: 0xff)                */
#define LEDTS1_LDCMP0_CMP_LD3_Pos             (24UL)                    /*!< LEDTS1 LDCMP0: CMP_LD3 (Bit 24)                             */
#define LEDTS1_LDCMP0_CMP_LD3_Msk             (0xff000000UL)            /*!< LEDTS1 LDCMP0: CMP_LD3 (Bitfield-Mask: 0xff)                */

/* --------------------------------  LEDTS1_LDCMP1  ------------------------------- */
#define LEDTS1_LDCMP1_CMP_LD4_Pos             (0UL)                     /*!< LEDTS1 LDCMP1: CMP_LD4 (Bit 0)                              */
#define LEDTS1_LDCMP1_CMP_LD4_Msk             (0xffUL)                  /*!< LEDTS1 LDCMP1: CMP_LD4 (Bitfield-Mask: 0xff)                */
#define LEDTS1_LDCMP1_CMP_LD5_Pos             (8UL)                     /*!< LEDTS1 LDCMP1: CMP_LD5 (Bit 8)                              */
#define LEDTS1_LDCMP1_CMP_LD5_Msk             (0xff00UL)                /*!< LEDTS1 LDCMP1: CMP_LD5 (Bitfield-Mask: 0xff)                */
#define LEDTS1_LDCMP1_CMP_LD6_Pos             (16UL)                    /*!< LEDTS1 LDCMP1: CMP_LD6 (Bit 16)                             */
#define LEDTS1_LDCMP1_CMP_LD6_Msk             (0xff0000UL)              /*!< LEDTS1 LDCMP1: CMP_LD6 (Bitfield-Mask: 0xff)                */
#define LEDTS1_LDCMP1_CMP_LDA_TSCOM_Pos       (24UL)                    /*!< LEDTS1 LDCMP1: CMP_LDA_TSCOM (Bit 24)                       */
#define LEDTS1_LDCMP1_CMP_LDA_TSCOM_Msk       (0xff000000UL)            /*!< LEDTS1 LDCMP1: CMP_LDA_TSCOM (Bitfield-Mask: 0xff)          */

/* --------------------------------  LEDTS1_TSCMP0  ------------------------------- */
#define LEDTS1_TSCMP0_CMP_TS0_Pos             (0UL)                     /*!< LEDTS1 TSCMP0: CMP_TS0 (Bit 0)                              */
#define LEDTS1_TSCMP0_CMP_TS0_Msk             (0xffUL)                  /*!< LEDTS1 TSCMP0: CMP_TS0 (Bitfield-Mask: 0xff)                */
#define LEDTS1_TSCMP0_CMP_TS1_Pos             (8UL)                     /*!< LEDTS1 TSCMP0: CMP_TS1 (Bit 8)                              */
#define LEDTS1_TSCMP0_CMP_TS1_Msk             (0xff00UL)                /*!< LEDTS1 TSCMP0: CMP_TS1 (Bitfield-Mask: 0xff)                */
#define LEDTS1_TSCMP0_CMP_TS2_Pos             (16UL)                    /*!< LEDTS1 TSCMP0: CMP_TS2 (Bit 16)                             */
#define LEDTS1_TSCMP0_CMP_TS2_Msk             (0xff0000UL)              /*!< LEDTS1 TSCMP0: CMP_TS2 (Bitfield-Mask: 0xff)                */
#define LEDTS1_TSCMP0_CMP_TS3_Pos             (24UL)                    /*!< LEDTS1 TSCMP0: CMP_TS3 (Bit 24)                             */
#define LEDTS1_TSCMP0_CMP_TS3_Msk             (0xff000000UL)            /*!< LEDTS1 TSCMP0: CMP_TS3 (Bitfield-Mask: 0xff)                */

/* --------------------------------  LEDTS1_TSCMP1  ------------------------------- */
#define LEDTS1_TSCMP1_CMP_TS4_Pos             (0UL)                     /*!< LEDTS1 TSCMP1: CMP_TS4 (Bit 0)                              */
#define LEDTS1_TSCMP1_CMP_TS4_Msk             (0xffUL)                  /*!< LEDTS1 TSCMP1: CMP_TS4 (Bitfield-Mask: 0xff)                */
#define LEDTS1_TSCMP1_CMP_TS5_Pos             (8UL)                     /*!< LEDTS1 TSCMP1: CMP_TS5 (Bit 8)                              */
#define LEDTS1_TSCMP1_CMP_TS5_Msk             (0xff00UL)                /*!< LEDTS1 TSCMP1: CMP_TS5 (Bitfield-Mask: 0xff)                */
#define LEDTS1_TSCMP1_CMP_TS6_Pos             (16UL)                    /*!< LEDTS1 TSCMP1: CMP_TS6 (Bit 16)                             */
#define LEDTS1_TSCMP1_CMP_TS6_Msk             (0xff0000UL)              /*!< LEDTS1 TSCMP1: CMP_TS6 (Bitfield-Mask: 0xff)                */
#define LEDTS1_TSCMP1_CMP_TS7_Pos             (24UL)                    /*!< LEDTS1 TSCMP1: CMP_TS7 (Bit 24)                             */
#define LEDTS1_TSCMP1_CMP_TS7_Msk             (0xff000000UL)            /*!< LEDTS1 TSCMP1: CMP_TS7 (Bitfield-Mask: 0xff)                */


/* ================================================================================ */
/* ================         struct 'LEDTS2' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------------  LEDTS2_ID  --------------------------------- */
#define LEDTS2_ID_MOD_REV_Pos                 (0UL)                     /*!< LEDTS2 ID: MOD_REV (Bit 0)                                  */
#define LEDTS2_ID_MOD_REV_Msk                 (0xffUL)                  /*!< LEDTS2 ID: MOD_REV (Bitfield-Mask: 0xff)                    */
#define LEDTS2_ID_MOD_TYPE_Pos                (8UL)                     /*!< LEDTS2 ID: MOD_TYPE (Bit 8)                                 */
#define LEDTS2_ID_MOD_TYPE_Msk                (0xff00UL)                /*!< LEDTS2 ID: MOD_TYPE (Bitfield-Mask: 0xff)                   */
#define LEDTS2_ID_MOD_NUMBER_Pos              (16UL)                    /*!< LEDTS2 ID: MOD_NUMBER (Bit 16)                              */
#define LEDTS2_ID_MOD_NUMBER_Msk              (0xffff0000UL)            /*!< LEDTS2 ID: MOD_NUMBER (Bitfield-Mask: 0xffff)               */

/* -------------------------------  LEDTS2_GLOBCTL  ------------------------------- */
#define LEDTS2_GLOBCTL_TS_EN_Pos              (0UL)                     /*!< LEDTS2 GLOBCTL: TS_EN (Bit 0)                               */
#define LEDTS2_GLOBCTL_TS_EN_Msk              (0x1UL)                   /*!< LEDTS2 GLOBCTL: TS_EN (Bitfield-Mask: 0x01)                 */
#define LEDTS2_GLOBCTL_LD_EN_Pos              (1UL)                     /*!< LEDTS2 GLOBCTL: LD_EN (Bit 1)                               */
#define LEDTS2_GLOBCTL_LD_EN_Msk              (0x2UL)                   /*!< LEDTS2 GLOBCTL: LD_EN (Bitfield-Mask: 0x01)                 */
#define LEDTS2_GLOBCTL_CMTR_Pos               (2UL)                     /*!< LEDTS2 GLOBCTL: CMTR (Bit 2)                                */
#define LEDTS2_GLOBCTL_CMTR_Msk               (0x4UL)                   /*!< LEDTS2 GLOBCTL: CMTR (Bitfield-Mask: 0x01)                  */
#define LEDTS2_GLOBCTL_ENSYNC_Pos             (3UL)                     /*!< LEDTS2 GLOBCTL: ENSYNC (Bit 3)                              */
#define LEDTS2_GLOBCTL_ENSYNC_Msk             (0x8UL)                   /*!< LEDTS2 GLOBCTL: ENSYNC (Bitfield-Mask: 0x01)                */
#define LEDTS2_GLOBCTL_SUSCFG_Pos             (8UL)                     /*!< LEDTS2 GLOBCTL: SUSCFG (Bit 8)                              */
#define LEDTS2_GLOBCTL_SUSCFG_Msk             (0x100UL)                 /*!< LEDTS2 GLOBCTL: SUSCFG (Bitfield-Mask: 0x01)                */
#define LEDTS2_GLOBCTL_MASKVAL_Pos            (9UL)                     /*!< LEDTS2 GLOBCTL: MASKVAL (Bit 9)                             */
#define LEDTS2_GLOBCTL_MASKVAL_Msk            (0xe00UL)                 /*!< LEDTS2 GLOBCTL: MASKVAL (Bitfield-Mask: 0x07)               */
#define LEDTS2_GLOBCTL_FENVAL_Pos             (12UL)                    /*!< LEDTS2 GLOBCTL: FENVAL (Bit 12)                             */
#define LEDTS2_GLOBCTL_FENVAL_Msk             (0x1000UL)                /*!< LEDTS2 GLOBCTL: FENVAL (Bitfield-Mask: 0x01)                */
#define LEDTS2_GLOBCTL_ITS_EN_Pos             (13UL)                    /*!< LEDTS2 GLOBCTL: ITS_EN (Bit 13)                             */
#define LEDTS2_GLOBCTL_ITS_EN_Msk             (0x2000UL)                /*!< LEDTS2 GLOBCTL: ITS_EN (Bitfield-Mask: 0x01)                */
#define LEDTS2_GLOBCTL_ITF_EN_Pos             (14UL)                    /*!< LEDTS2 GLOBCTL: ITF_EN (Bit 14)                             */
#define LEDTS2_GLOBCTL_ITF_EN_Msk             (0x4000UL)                /*!< LEDTS2 GLOBCTL: ITF_EN (Bitfield-Mask: 0x01)                */
#define LEDTS2_GLOBCTL_ITP_EN_Pos             (15UL)                    /*!< LEDTS2 GLOBCTL: ITP_EN (Bit 15)                             */
#define LEDTS2_GLOBCTL_ITP_EN_Msk             (0x8000UL)                /*!< LEDTS2 GLOBCTL: ITP_EN (Bitfield-Mask: 0x01)                */
#define LEDTS2_GLOBCTL_CLK_PS_Pos             (16UL)                    /*!< LEDTS2 GLOBCTL: CLK_PS (Bit 16)                             */
#define LEDTS2_GLOBCTL_CLK_PS_Msk             (0xffff0000UL)            /*!< LEDTS2 GLOBCTL: CLK_PS (Bitfield-Mask: 0xffff)              */

/* --------------------------------  LEDTS2_FNCTL  -------------------------------- */
#define LEDTS2_FNCTL_PADT_Pos                 (0UL)                     /*!< LEDTS2 FNCTL: PADT (Bit 0)                                  */
#define LEDTS2_FNCTL_PADT_Msk                 (0x7UL)                   /*!< LEDTS2 FNCTL: PADT (Bitfield-Mask: 0x07)                    */
#define LEDTS2_FNCTL_PADTSW_Pos               (3UL)                     /*!< LEDTS2 FNCTL: PADTSW (Bit 3)                                */
#define LEDTS2_FNCTL_PADTSW_Msk               (0x8UL)                   /*!< LEDTS2 FNCTL: PADTSW (Bitfield-Mask: 0x01)                  */
#define LEDTS2_FNCTL_EPULL_Pos                (4UL)                     /*!< LEDTS2 FNCTL: EPULL (Bit 4)                                 */
#define LEDTS2_FNCTL_EPULL_Msk                (0x10UL)                  /*!< LEDTS2 FNCTL: EPULL (Bitfield-Mask: 0x01)                   */
#define LEDTS2_FNCTL_FNCOL_Pos                (5UL)                     /*!< LEDTS2 FNCTL: FNCOL (Bit 5)                                 */
#define LEDTS2_FNCTL_FNCOL_Msk                (0xe0UL)                  /*!< LEDTS2 FNCTL: FNCOL (Bitfield-Mask: 0x07)                   */
#define LEDTS2_FNCTL_ACCCNT_Pos               (16UL)                    /*!< LEDTS2 FNCTL: ACCCNT (Bit 16)                               */
#define LEDTS2_FNCTL_ACCCNT_Msk               (0xf0000UL)               /*!< LEDTS2 FNCTL: ACCCNT (Bitfield-Mask: 0x0f)                  */
#define LEDTS2_FNCTL_TSCCMP_Pos               (20UL)                    /*!< LEDTS2 FNCTL: TSCCMP (Bit 20)                               */
#define LEDTS2_FNCTL_TSCCMP_Msk               (0x100000UL)              /*!< LEDTS2 FNCTL: TSCCMP (Bitfield-Mask: 0x01)                  */
#define LEDTS2_FNCTL_TSOEXT_Pos               (21UL)                    /*!< LEDTS2 FNCTL: TSOEXT (Bit 21)                               */
#define LEDTS2_FNCTL_TSOEXT_Msk               (0x600000UL)              /*!< LEDTS2 FNCTL: TSOEXT (Bitfield-Mask: 0x03)                  */
#define LEDTS2_FNCTL_TSCTRR_Pos               (23UL)                    /*!< LEDTS2 FNCTL: TSCTRR (Bit 23)                               */
#define LEDTS2_FNCTL_TSCTRR_Msk               (0x800000UL)              /*!< LEDTS2 FNCTL: TSCTRR (Bitfield-Mask: 0x01)                  */
#define LEDTS2_FNCTL_TSCTRSAT_Pos             (24UL)                    /*!< LEDTS2 FNCTL: TSCTRSAT (Bit 24)                             */
#define LEDTS2_FNCTL_TSCTRSAT_Msk             (0x1000000UL)             /*!< LEDTS2 FNCTL: TSCTRSAT (Bitfield-Mask: 0x01)                */
#define LEDTS2_FNCTL_NR_TSIN_Pos              (25UL)                    /*!< LEDTS2 FNCTL: NR_TSIN (Bit 25)                              */
#define LEDTS2_FNCTL_NR_TSIN_Msk              (0xe000000UL)             /*!< LEDTS2 FNCTL: NR_TSIN (Bitfield-Mask: 0x07)                 */
#define LEDTS2_FNCTL_COLLEV_Pos               (28UL)                    /*!< LEDTS2 FNCTL: COLLEV (Bit 28)                               */
#define LEDTS2_FNCTL_COLLEV_Msk               (0x10000000UL)            /*!< LEDTS2 FNCTL: COLLEV (Bitfield-Mask: 0x01)                  */
#define LEDTS2_FNCTL_NR_LEDCOL_Pos            (29UL)                    /*!< LEDTS2 FNCTL: NR_LEDCOL (Bit 29)                            */
#define LEDTS2_FNCTL_NR_LEDCOL_Msk            (0xe0000000UL)            /*!< LEDTS2 FNCTL: NR_LEDCOL (Bitfield-Mask: 0x07)               */

