MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1403-Q040X0064/mcu.h
/* ----------------------------------  CCU4_MIDR  --------------------------------- */
#define CCU4_MIDR_MODR_Pos                    (0UL)                     /*!< CCU4 MIDR: MODR (Bit 0)                                     */
#define CCU4_MIDR_MODR_Msk                    (0xffUL)                  /*!< CCU4 MIDR: MODR (Bitfield-Mask: 0xff)                       */
#define CCU4_MIDR_MODT_Pos                    (8UL)                     /*!< CCU4 MIDR: MODT (Bit 8)                                     */
#define CCU4_MIDR_MODT_Msk                    (0xff00UL)                /*!< CCU4 MIDR: MODT (Bitfield-Mask: 0xff)                       */
#define CCU4_MIDR_MODN_Pos                    (16UL)                    /*!< CCU4 MIDR: MODN (Bit 16)                                    */
#define CCU4_MIDR_MODN_Msk                    (0xffff0000UL)            /*!< CCU4 MIDR: MODN (Bitfield-Mask: 0xffff)                     */


/* ================================================================================ */
/* ================        Group 'CCU4_CC4' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  CCU4_CC4_INS2  ------------------------------- */
#define CCU4_CC4_INS2_EV0EM_Pos               (0UL)                     /*!< CCU4_CC4 INS2: EV0EM (Bit 0)                                */
#define CCU4_CC4_INS2_EV0EM_Msk               (0x3UL)                   /*!< CCU4_CC4 INS2: EV0EM (Bitfield-Mask: 0x03)                  */
#define CCU4_CC4_INS2_EV0LM_Pos               (2UL)                     /*!< CCU4_CC4 INS2: EV0LM (Bit 2)                                */
#define CCU4_CC4_INS2_EV0LM_Msk               (0x4UL)                   /*!< CCU4_CC4 INS2: EV0LM (Bitfield-Mask: 0x01)                  */
#define CCU4_CC4_INS2_EV1EM_Pos               (4UL)                     /*!< CCU4_CC4 INS2: EV1EM (Bit 4)                                */
#define CCU4_CC4_INS2_EV1EM_Msk               (0x30UL)                  /*!< CCU4_CC4 INS2: EV1EM (Bitfield-Mask: 0x03)                  */
#define CCU4_CC4_INS2_EV1LM_Pos               (6UL)                     /*!< CCU4_CC4 INS2: EV1LM (Bit 6)                                */
#define CCU4_CC4_INS2_EV1LM_Msk               (0x40UL)                  /*!< CCU4_CC4 INS2: EV1LM (Bitfield-Mask: 0x01)                  */
#define CCU4_CC4_INS2_EV2EM_Pos               (8UL)                     /*!< CCU4_CC4 INS2: EV2EM (Bit 8)                                */
#define CCU4_CC4_INS2_EV2EM_Msk               (0x300UL)                 /*!< CCU4_CC4 INS2: EV2EM (Bitfield-Mask: 0x03)                  */
#define CCU4_CC4_INS2_EV2LM_Pos               (10UL)                    /*!< CCU4_CC4 INS2: EV2LM (Bit 10)                               */
#define CCU4_CC4_INS2_EV2LM_Msk               (0x400UL)                 /*!< CCU4_CC4 INS2: EV2LM (Bitfield-Mask: 0x01)                  */
#define CCU4_CC4_INS2_LPF0M_Pos               (16UL)                    /*!< CCU4_CC4 INS2: LPF0M (Bit 16)                               */
#define CCU4_CC4_INS2_LPF0M_Msk               (0x30000UL)               /*!< CCU4_CC4 INS2: LPF0M (Bitfield-Mask: 0x03)                  */
#define CCU4_CC4_INS2_LPF1M_Pos               (20UL)                    /*!< CCU4_CC4 INS2: LPF1M (Bit 20)                               */
#define CCU4_CC4_INS2_LPF1M_Msk               (0x300000UL)              /*!< CCU4_CC4 INS2: LPF1M (Bitfield-Mask: 0x03)                  */
#define CCU4_CC4_INS2_LPF2M_Pos               (24UL)                    /*!< CCU4_CC4 INS2: LPF2M (Bit 24)                               */
#define CCU4_CC4_INS2_LPF2M_Msk               (0x3000000UL)             /*!< CCU4_CC4 INS2: LPF2M (Bitfield-Mask: 0x03)                  */

/* --------------------------------  CCU4_CC4_CMC  -------------------------------- */
#define CCU4_CC4_CMC_STRTS_Pos                (0UL)                     /*!< CCU4_CC4 CMC: STRTS (Bit 0)                                 */
#define CCU4_CC4_CMC_STRTS_Msk                (0x3UL)                   /*!< CCU4_CC4 CMC: STRTS (Bitfield-Mask: 0x03)                   */
#define CCU4_CC4_CMC_ENDS_Pos                 (2UL)                     /*!< CCU4_CC4 CMC: ENDS (Bit 2)                                  */
#define CCU4_CC4_CMC_ENDS_Msk                 (0xcUL)                   /*!< CCU4_CC4 CMC: ENDS (Bitfield-Mask: 0x03)                    */
#define CCU4_CC4_CMC_CAP0S_Pos                (4UL)                     /*!< CCU4_CC4 CMC: CAP0S (Bit 4)                                 */
#define CCU4_CC4_CMC_CAP0S_Msk                (0x30UL)                  /*!< CCU4_CC4 CMC: CAP0S (Bitfield-Mask: 0x03)                   */
#define CCU4_CC4_CMC_CAP1S_Pos                (6UL)                     /*!< CCU4_CC4 CMC: CAP1S (Bit 6)                                 */
#define CCU4_CC4_CMC_CAP1S_Msk                (0xc0UL)                  /*!< CCU4_CC4 CMC: CAP1S (Bitfield-Mask: 0x03)                   */
#define CCU4_CC4_CMC_GATES_Pos                (8UL)                     /*!< CCU4_CC4 CMC: GATES (Bit 8)                                 */
#define CCU4_CC4_CMC_GATES_Msk                (0x300UL)                 /*!< CCU4_CC4 CMC: GATES (Bitfield-Mask: 0x03)                   */
#define CCU4_CC4_CMC_UDS_Pos                  (10UL)                    /*!< CCU4_CC4 CMC: UDS (Bit 10)                                  */
#define CCU4_CC4_CMC_UDS_Msk                  (0xc00UL)                 /*!< CCU4_CC4 CMC: UDS (Bitfield-Mask: 0x03)                     */
#define CCU4_CC4_CMC_LDS_Pos                  (12UL)                    /*!< CCU4_CC4 CMC: LDS (Bit 12)                                  */
#define CCU4_CC4_CMC_LDS_Msk                  (0x3000UL)                /*!< CCU4_CC4 CMC: LDS (Bitfield-Mask: 0x03)                     */
#define CCU4_CC4_CMC_CNTS_Pos                 (14UL)                    /*!< CCU4_CC4 CMC: CNTS (Bit 14)                                 */
#define CCU4_CC4_CMC_CNTS_Msk                 (0xc000UL)                /*!< CCU4_CC4 CMC: CNTS (Bitfield-Mask: 0x03)                    */
#define CCU4_CC4_CMC_OFS_Pos                  (16UL)                    /*!< CCU4_CC4 CMC: OFS (Bit 16)                                  */
#define CCU4_CC4_CMC_OFS_Msk                  (0x10000UL)               /*!< CCU4_CC4 CMC: OFS (Bitfield-Mask: 0x01)                     */
#define CCU4_CC4_CMC_TS_Pos                   (17UL)                    /*!< CCU4_CC4 CMC: TS (Bit 17)                                   */
#define CCU4_CC4_CMC_TS_Msk                   (0x20000UL)               /*!< CCU4_CC4 CMC: TS (Bitfield-Mask: 0x01)                      */
#define CCU4_CC4_CMC_MOS_Pos                  (18UL)                    /*!< CCU4_CC4 CMC: MOS (Bit 18)                                  */
#define CCU4_CC4_CMC_MOS_Msk                  (0xc0000UL)               /*!< CCU4_CC4 CMC: MOS (Bitfield-Mask: 0x03)                     */
#define CCU4_CC4_CMC_TCE_Pos                  (20UL)                    /*!< CCU4_CC4 CMC: TCE (Bit 20)                                  */
#define CCU4_CC4_CMC_TCE_Msk                  (0x100000UL)              /*!< CCU4_CC4 CMC: TCE (Bitfield-Mask: 0x01)                     */

